from markupsafe import escape, Markup

CQ_CHOICES = [(0, '0$'), (50, '0.50$'), (100, '1.00$'), (150, '1.50$')]

REVEAL_CHOICES = [(True, Markup('Я  хочу узнать ответ участника Б')),
                  (False, 'Я не хочу узнать ответ участника Б')]
OPINION_CHOICES = [(True, 'Согласен/согласна'), (False, 'Не согласен/не согласна'), ]
AGE_CHOICES = ["Младше 18",
               "18-24",
               "25-34",
               "35-44",
               "45-54",
               "55-64",
               "65 лет и старше",
               ]

EDUCATION_CHOICES = [
    'Средняя школа',
    'Среднее профессиональное образование',
    'Незаконченное высшее образование',
    'Высшее образование',
    'Два и более диплома / Ученая степень']

GENDER_CHOICES = [
    "Мужской",
    "Женский",

]

MARITAL_CHOICES = ['Не женаты/не замужем',
                   'Женаты/замужем',
                   'В отношениях, но официально не состоите в браке',
                   'Разведены',
                   'Живете отдельно от супруга/и',
                   'Вдовец/Вдова']
EMPLOYMENT_CHOICES = [
    "Трудоустроен (полный рабочий день)",
    "Трудоустроен (частичная занятость)",
    "Самозанятый",
    "Не работаю и ищу работу",
    "Не работаю (на пенсии)",
    "Не работаю (по состоянию здоровья)",
    'Не работаю (другое)',
    "Предпочитаю не отвечать",
]

OCCUPATION_CHOICES = [
    "Менеджемент, управление",
    "Сфера услуг",
    "Продажи",
    "Сельское хозяйство",
    "Строительство и ремонт",
    "Производство и транспортировка",
    "Госслужба",
    "Военнослужащий",
    "Другое",
    "Предпочитаю не отвечать",
]
