from markupsafe import escape, Markup

CQ_CHOICES = [(0, '0$'), (50, '0.50$'), (100, '1.00$'), (150, '1.50$')]

REVEAL_CHOICES = [(True, Markup('Я  хочу узнать ответ участника Б')),
                  (False, 'Я не хочу узнать ответ участника Б')]
RECEPIENT_REVEAL_CHOICES = [(True, 'Да'),
                            (False, 'Нет')]

OPINION_CHOICES = [(True, 'Поддерживаю'), (False, 'Не поддерживаю'), ]
INTENSITY_YES_CHOICES = [(False, 'Скорее поддерживаю'), (True, 'Определенно поддерживаю'), ]
INTENSITY_NO_CHOICES = [(False, 'Скорее не поддерживаю'), (True, 'Определенно не поддерживаю'), ]

IAS_CHOICES = ['Я предпочел бы не знать', 'Я хотел бы знать']
SDI_CHOICES = [
    "Я бы совершенно не расстроился",
    "Я бы скорее не расстроился ",
    "Я бы немного расстроился",
    "Я бы сильно расстроился "
]
EDUCATION_CHOICES = [(0, 'Средняя школа'),
                     (1, 'Среднее профессиональное образование'),
                     (2, 'Незаконченное высшее образование'),
                     (3, 'Высшее образование'),
                     (4, 'Два и более диплома / Ученая степень')]

GENDER_CHOICES = [(0, 'Мужской'), (1, 'Женский')]

INCOME_CHOICES = [(0, 'Не хватает денег даже на еду'),
                  (1, 'Хватает на еду, но не хватает на покупку одежды и обуви'),
                  (2,
                   'Хватает на одежду и обувь, но не хватает на покупку мелкой бытовой техники'),
                  (3,
                   'Хватает денег на небольшие покупки, но покупка дорогих вещей (компьютера, '
                   'стиральной машины, холодильника) требует накоплений или кредита'),
                  (4,
                   'Хватает денег на покупки для дома, но на покупку машины, дачи, квартиры '
                   'необходимо копить или брать кредит'),
                  (5, 'Можем позволить себе любые покупки без ограничений и кредитов')]
